<template>
  <div class="hello">
    <h1>Зачем это нужно?</h1>
    <h4>
      Рейтингование - это процесс оценки и сравнения производительности и/или
      качества исполнения задач и/или обслуживания услуг поставщиками для
      заказчиков в бизнесе.
    </h4>
    <div class="hello-info">
      <div class="icon-wrapper">
        <img src="../assets/1.png" alt="ICON" class="icon" />
        <p>
          Рейтингование в аналитике может быть использовано для измерения
          различных показателей, включая продажи, доходы, маржинальность, чистую
          прибыль, рост, удельную долю рынка и многие другие факторы,
          относящиеся к деятельности компании. Оценка этих показателей может
          помочь компании понять, насколько эффективно она работает, и выявить
          области для улучшения.
        </p>
      </div>
      <div class="icon-wrapper">
        <img src="../assets/2.png" alt="ICON" class="icon" />
        <p>
          Рейтинги могут также использоваться для сравнения результатов с
          конкурентами или отраслевыми стандартами. Это поможет определить,
          какая компания лидирует в отрасли, а также позволит выявить
          преимущества или недостатки компании по сравнению с конкурентами.
        </p>
      </div>
    </div>

    <div class="hello-info">
      <div class="icon-wrapper">
        <img src="../assets/3.png" alt="ICON" class="icon" />
        <p>
          Еще одно важное применение рейтингования - это оценка качества
          продуктов или услуг. Определение уровня качества позволит компании
          улучшить свои продукты и услуги и выделить наиболее успешные продукты
          для дальнейшего развития.
        </p>
      </div>
      <div class="icon-wrapper">
        <img src="../assets/4.png" alt="ICON" class="icon" />
        <p>
          Рейтингование может помочь компании принимать решения относительно
          распределения своего бюджета, определения приоритетов и целей, а также
          для прогнозирования будущих результатов. Например, поменять
          направление предприятия или поработать над маркетингом.
        </p>
      </div>
    </div>
    <h2>Разновидности рейтингов:</h2>
    <div class="wrapper">
      <img src="../assets/zakaz.jpeg" alt="ICON" class="img" />
      <div>
        <h3>Рейтинг заказчиков</h3>
        <p>
          Рейтингование заказчиков - это оценка качества работы заказчиков. Она
          может быть основана на таких показателях, как своевременность оплаты,
          точность и полнота заказов, качество общения и т.д. Высокий рейтинг
          заказчика говорит о том, что он надежен и выполняет свои обязательства
          в срок.
        </p>
        <h4>Также, который также может включать:</h4>
        <ul>
          <li>Количество заказов</li>
          <li>Величина заказа</li>
          <li>Соотношение цена/качество</li>
          <li>Сроки выполнения заказов</li>
          <li>Объем денежных потоков</li>
        </ul>
        <p>
          Рейтинг заказчиков оценивает, насколько хорошо они быстро и адекватно
          оплачивают свои счета, своевременно и точно предоставляют информацию о
          своих потребностях и требованиях для поставщиков.
        </p>
      </div>
    </div>
    <hr />
    <div class="wrapper">
      <img src="../assets/post.png" alt="ICON" class="img" />
      <div>
        <h3>Рейтинг поставщиков</h3>
        <p>
          Рейтингование поставщиков - это оценка качества работы поставщиков
          товаров или услуг. Обычно она основывается на таких показателях, как
          качество продукции, сроки поставки, цены, качество обслуживания и т.д.
          Оценка может быть произведена самим заказчиком или сторонней
          организацией. Высокий рейтинг говорит о том, что поставщик надежен и
          выполняет свои обязательства в срок.
        </p>
        <h4>Рейтинг поставщика может включать:</h4>
        <ul>
          <li>Количество выполненных заказов</li>
          <li>Качество выполненных работ</li>
          <li>Сроки выполнения заказов</li>
          <li>Надежность поставщика</li>
          <li>Реливантный опыт</li>
          <li>Средняя стоимость</li>
          <li>Доля выполненных работ</li>
          <li>Размер компании (соответствует ли возможному заказу)</li>
        </ul>
        <p>
          Рейтинг поставщиков оценивает, насколько хорошо они выполняют заказы,
          соответствуют требованиям, соблюдают сроки, и в целом удовлетворяют
          потребности заказчиков.
        </p>
      </div>
    </div>
    <hr />
    <div class="wrapper">
      <img src="../assets/komb.jpeg" alt="ICON" class="img" />
      <div>
        <h3>Комбинированное рейтингование</h3>
        <p>
          Комбинированное рейтингование - это оценка качества работы и
          поставщиков, и заказчиков. Она может основываться на различных
          показателях, в зависимости от того, какие аспекты работы считаются
          важными для конкретной отрасли или компании. Такое рейтингование может
          помочь определить, какие поставщики и заказчики являются наиболее
          надежными и выгодными для бизнеса.
        </p>
        <h4>Оно может включать и другие параметры, такие как:</h4>
        <ul>
          <li>Уровень обслуживания</li>
          <li>Удовлетворенность клиентов</li>
          <li>Соотношение цена/качество</li>
          <li>Сроки выполнения заказов</li>
          <li>Репутация компаний</li>
        </ul>
        <p>
          Комбинированное рейтингование может включать как рейтинг заказчиков,
          так и рейтинг поставщиков. Оно оценивает все аспекты исполнения
          заказов, соответствующие обеим сторонам.
        </p>
      </div>
    </div>
    <hr />
    <div class="wrapper">
      <img src="../assets/5.jpeg" alt="ICON" class="img" />
      <div>
        <h3>Комбинированное рейтингование</h3>
        <p>
          Рейтингование в аналитике имеет множество применений. Оно может быть
          использовано для оценки производительности компаний и отделов,
          сравнения их результатов с конкурентами или отраслевыми стандартами.
          Рейтинги также могут использоваться для оценки качества продуктов или
          услуг и для выделения наиболее эффективных стратегий маркетинга. Кроме
          того, рейтингование может быть полезным при принятии решений о
          распределении бюджета, определении приоритетов и целей, а также для
          прогнозирования будущих результатов.
        </p>
        <p>
          Важно понимать, что рейтингование не является единственным критерием
          выбора поставщика или заказчика. Оно может служить лишь дополнительным
          инструментом при принятии решений. Кроме того, оценка качества работы
          может быть субъективной и зависеть от мнения конкретных людей или
          организаций. Поэтому при выборе поставщиков или заказчиков важно
          учитывать не только рейтинг, но и другие факторы, такие как цена,
          качество продукции, условия поставки и т.д.
        </p>
      </div>
    </div>
    <div class="wrapper">
      <div>
        <h3>
          Рейтингование может быть полезным инструментом для бизнеса по
          нескольким причинам:
        </h3>
        <ul>
          <li>
            1. Помощь в выборе поставщиков или заказчиков. Рейтингование может
            помочь определить, какие поставщики или заказчики являются наиболее
            надежными и выгодными для бизнеса. Это может помочь сэкономить время
            и уменьшить риски при выборе партнеров.
          </li>
          <li>
            2. Улучшение качества работы. Рейтингование может стимулировать
            поставщиков и заказчиков к улучшению качества своей работы,
            поскольку высокий рейтинг может привести к большему количеству
            заказов и увеличению прибыли.
          </li>
          <li>
            3. Оценка эффективности работы. Рейтингование может помочь бизнесу
            оценить эффективность своей работы и выявить проблемные места в
            отношениях с поставщиками или заказчиками. Это может помочь снизить
            издержки и увеличить прибыль.
          </li>
          <li>
            4. Создание конкуренции. Рейтингование может стимулировать
            поставщиков и заказчиков к созданию конкуренции, что может привести
            к улучшению качества продукции и услуг, а также к снижению цен.
          </li>
          <li>
            5. Улучшение репутации. Высокий рейтинг может помочь поставщикам и
            заказчикам улучшить свою репутацию на рынке и привлечь больше
            клиентов.
          </li>
        </ul>
        <p>
          В целом, рейтингование может быть полезным инструментом для бизнеса,
          который помогает определить наиболее надежных и выгодных партнеров,
          повысить качество работы и улучшить репутацию на рынке.
        </p>
      </div>
    </div>
    <hr />
  </div>
</template>

<script lang="ts">
import { defineComponent } from "vue";

export default defineComponent({
  name: "HelloWorld",
  props: {
    msg: String,
  },
});
</script>

<style lang="scss" scoped>
.hello {
  width: 100vw;
}

.wrapper {
  display: flex;
  margin: 30px;
  margin-left: 5vw;
  margin-right: 5vw;

  .img {
    max-width: 600px;
  }
  ul {
    list-style: none;
    border-left: 10px solid #78909c;
    padding: 0;
    font-family: "Lucida Sans";
    margin-left: 30px;
    li {
      padding: 10px;
    }
    li:nth-child(odd) {
      background: #e1f1ff;
    }
    li:nth-child(even) {
      background: white;
    }
  }
}
p {
  position: relative;
  width: 100%;
  min-height: 1px;
  padding-right: 30px;
  padding-left: 30px;
  color: #78909c;
  text-align: left;
}

h1 {
  font-size: 2.5rem;
}

.hello-info {
  display: flex;
  margin-left: 10vh;
}

.icon {
  width: 64px;
  height: 64px;
}

.icon-wrapper {
  display: flex;
  align-items: center;
  width: 45vw;
}

@media (max-width: 900px) {
  .wrapper {
    display: flex;
    flex-direction: column;
    align-items: center;
  }
  .hello-info {
    display: flex;
    flex-direction: column;
    align-items: center;
  }
  .icon-wrapper {
    width: 100%;
  }
}
</style>
